Revit 2027 API
ProjectLocationSet.Insert Method
Insert the specified project location into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	ProjectLocation item
)
Public Overridable Function Insert (
	item As ProjectLocation
) As Boolean
public:
virtual bool Insert(
	ProjectLocation^ item
)
abstract Insert :
        item : ProjectLocation -> bool
override Insert :
        item : ProjectLocation -> bool
Parameters
item ProjectLocation
The project location to be inserted into the set.
Return Value
Boolean
Returns whether the project location was inserted into the set.
See Also
Reference
ProjectLocationSet Class
Autodesk.Revit.DB Namespace